This is a short introduction to pandas, geared mainly for new users. You can see more complex recipes in the Cookbook.

http://pandas.pydata.org/pandas-docs/stable/user_guide/cookbook.html#cookbook

### Object Creation

In [58]:
import pandas as pd
import numpy as np

# Create a series by passing a list with a default integer index
s = pd.Series([1,3,5,np.nan,68,8,1])
s

0     1.0
1     3.0
2     5.0
3     NaN
4    68.0
5     8.0
6     1.0
dtype: float64

In [59]:
# Create a dataframe by passing a np array with a datetime index and column names
# Create dates by using pd.date_range()
dates = pd.date_range('20190601', periods=6)
dates

DatetimeIndex(['2019-06-01', '2019-06-02', '2019-06-03', '2019-06-04',
               '2019-06-05', '2019-06-06'],
              dtype='datetime64[ns]', freq='D')

In [60]:
date_df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [61]:
date_df

                   A         B         C         D
2019-06-01  0.096359  0.897291 -1.342778 -2.378516
2019-06-02 -1.438505 -0.389565  0.922404  0.078864
2019-06-03  0.630953  0.209136 -0.399125  1.404642
2019-06-04 -1.228804  0.501728 -0.839617  0.870606
2019-06-05  1.977991  0.598679 -0.513562 -1.491014
2019-06-06  0.571910 -0.553417  0.035876  0.060217

In [62]:
# Create a dataframe by passing a numpy random array with 6 columns
date_df2 = pd.DataFrame(np.random.randn(6,6), index=dates, columns=list('ABCDEF'))
date_df2

                   A         B         C         D         E         F
2019-06-01  0.278023 -1.273212  0.168704  0.684516  1.120433  0.062501
2019-06-02  0.101596  0.404128  0.665063  1.305505 -2.899144  1.108227
2019-06-03 -0.332036 -1.573384  1.808703  0.241105 -1.956223 -0.573458
2019-06-04  0.538140 -1.734567 -2.038577 -0.095249  0.068912  0.288798
2019-06-05  2.075627  1.732575 -1.692173  0.426449 -1.025987  1.040021
2019-06-06 -0.083728  0.042746  1.266085  0.807146 -0.448907 -0.809999

In [63]:
# Create a dataframe by passing a dictionary of objects that can be
# converted to series-like
df = pd.DataFrame({
    'A': 1,
    'B': pd.Timestamp('20190601'),
    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
    'D': np.array([3] * 4, dtype='int32'),
    'E': pd.Categorical(["test", "train", "test", "train"]),
    'F': 'foo',
    'G': pd.date_range('20190601', periods=4)
})
df

   A          B    C  D      E    F          G
0  1 2019-06-01  1.0  3   test  foo 2019-06-01
1  1 2019-06-01  1.0  3  train  foo 2019-06-02
2  1 2019-06-01  1.0  3   test  foo 2019-06-03
3  1 2019-06-01  1.0  3  train  foo 2019-06-04

In [64]:
np.random.randn(8,5)

array([[ 1.21234601, -0.32682776,  1.87752993,  0.82213392, -2.10427804],
       [-0.08983454,  0.42184114,  0.70641631,  0.98651149, -0.32217579],
       [ 1.68733248, -0.66933517,  0.71573103,  1.16507232, -1.40916103],
       [-0.27450669,  0.39704283,  0.10980367, -1.34917784, -1.75299544],
       [-1.017261  , -1.16141267, -0.77585197,  0.11094778, -0.99195039],
       [ 1.43699067,  0.76208961, -1.54434099, -0.39084216, -0.11739492],
       [-0.26762519,  0.57820036, -0.30751182, -0.62786104,  0.53729021],
       [ 0.20661717, -0.38446593, -1.2914163 ,  1.29366852,  0.42976306]])

In [65]:
# 1D array
four_array = np.array([1]*4, dtype = 'int32')
print(type(four_array))
four_array

<class 'numpy.ndarray'>

array([1, 1, 1, 1])

In [66]:
'''
randn generates an array of shape (d0, d1, ..., dn), filled with random floats sampled 
from a univariate “normal” (Gaussian) distribution of mean 0 and variance 1
'''
four_rand = np.random.randn(4,1)
print(type(four_rand))
four_rand

<class 'numpy.ndarray'>

array([[-0.85240035],
       [-1.30463182],
       [ 0.58424291],
       [-0.75846791]])

In [67]:
# 2D array
np.array([[1,2], [3,4]])

array([[1, 2],
       [3, 4]])

In [221]:
newdates = pd.date_range('20190601', periods=8)
numbr_col = [i for i in range(8)]
colnames = ['A', 'B', 'C', 'D', 'E', 'F', 'H', 'I']
d = pd.DataFrame(np.random.randn(8,8), index=newdates, columns=colnames)
print(d)
d['J'] = numbr_col
d

                   A         B         C         D         E         F  \
2019-06-01 -2.207738  1.478202  0.884535 -2.720556 -0.660596 -1.602228
2019-06-02  0.824768  0.157232 -0.593674  1.782997 -0.332563  0.041474
2019-06-03 -0.021602  0.094429 -0.319473 -0.765534 -0.697075 -0.436549
2019-06-04  0.004618 -0.066793  0.541442  0.133224  1.162556 -0.425729
2019-06-05  0.371707 -0.543485 -0.012764 -0.327751  0.333590 -0.287908
2019-06-06  0.332172  1.032650 -0.100089  1.543487 -1.997948 -1.017744
2019-06-07  0.292403 -0.191311  0.500683  0.363139  0.905596 -1.223869
2019-06-08  0.667046 -1.560969 -0.952504  0.593079  1.041924  1.173221

                   H         I
2019-06-01 -0.415863 -1.298840
2019-06-02  1.193147 -0.759677
2019-06-03  0.180944 -0.516327
2019-06-04  0.899439  1.176599
2019-06-05  0.392684 -0.050448
2019-06-06 -1.089295 -0.622241
2019-06-07 -0.994163  1.134802
2019-06-08  1.177262 -0.646689

,A,B,C,D,E,F,H,I,J
2019-06-01,-2.207738,1.478202,0.884535,-2.720556,-0.660596,-1.602228,-0.415863,-1.298840,0
2019-06-02,0.824768,0.157232,-0.593674,1.782997,-0.332563,0.041474,1.193147,-0.759677,1
2019-06-03,-0.021602,0.094429,-0.319473,-0.765534,-0.697075,-0.436549,0.180944,-0.516327,2
2019-06-04,0.004618,-0.066793,0.541442,0.133224,1.162556,-0.425729,0.899439,1.176599,3
2019-06-05,0.371707,-0.543485,-0.012764,-0.327751,0.333590,-0.287908,0.392684,-0.050448,4
2019-06-06,0.332172,1.032650,-0.100089,1.543487,-1.997948,-1.017744,-1.089295,-0.622241,5
2019-06-07,0.292403,-0.191311,0.500683,0.363139,0.905596,-1.223869,-0.994163,1.134802,6
2019-06-08,0.667046,-1.560969,-0.952504,0.593079,1.041924,1.173221,1.177262,-0.646689,7

In [69]:
# Create a dataframe by passing a dictionary of objects that can be
# converted to series-like
df = pd.DataFrame({
    'A': 1,
    'B': pd.Timestamp('20190601'),
    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
    'D': np.array([3] * 4, dtype='int32'),
    'E': pd.Categorical(["test", "train", "test", "train"]),
    'F': 'foo',
    'G': pd.date_range('20190601', periods=4),
    'H': four_array
})
df

   A          B    C  D      E    F          G  H
0  1 2019-06-01  1.0  3   test  foo 2019-06-01  1
1  1 2019-06-01  1.0  3  train  foo 2019-06-02  1
2  1 2019-06-01  1.0  3   test  foo 2019-06-03  1
3  1 2019-06-01  1.0  3  train  foo 2019-06-04  1

In [70]:
df.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
G    datetime64[ns]
H             int32
dtype: object

In [71]:
type(df)

pandas.core.frame.DataFrame

In [72]:
df.loc[0]

A                      1
B    2019-06-01 00:00:00
C                      1
D                      3
E                   test
F                    foo
G    2019-06-01 00:00:00
H                      1
Name: 0, dtype: object

In [73]:
df.loc[0:2]

   A          B    C  D      E    F          G  H
0  1 2019-06-01  1.0  3   test  foo 2019-06-01  1
1  1 2019-06-01  1.0  3  train  foo 2019-06-02  1
2  1 2019-06-01  1.0  3   test  foo 2019-06-03  1

### Viewing Data

In [74]:
print(df.head())
print(df.tail())

   A          B    C  D      E    F          G  H
0  1 2019-06-01  1.0  3   test  foo 2019-06-01  1
1  1 2019-06-01  1.0  3  train  foo 2019-06-02  1
2  1 2019-06-01  1.0  3   test  foo 2019-06-03  1
3  1 2019-06-01  1.0  3  train  foo 2019-06-04  1
   A          B    C  D      E    F          G  H
0  1 2019-06-01  1.0  3   test  foo 2019-06-01  1
1  1 2019-06-01  1.0  3  train  foo 2019-06-02  1
2  1 2019-06-01  1.0  3   test  foo 2019-06-03  1
3  1 2019-06-01  1.0  3  train  foo 2019-06-04  1

In [75]:
# Display index
df.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [76]:
# Display columns
df.columns

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H'], dtype='object')

In [77]:
df.shape

(4, 8)

In [78]:
'''
df.to_numpy() gives a numPy rep of the underlying data.

NumPy arrays have one dtype for the entire array.
Pandas DataFrames have one dtype per column.
'''
date_df.to_numpy()

array([[ 0.09635852,  0.89729109, -1.34277754, -2.37851642],
       [-1.43850475, -0.38956498,  0.9224039 ,  0.07886441],
       [ 0.63095274,  0.20913573, -0.39912538,  1.40464229],
       [-1.22880374,  0.50172799, -0.83961691,  0.87060622],
       [ 1.9779911 ,  0.59867903, -0.51356151, -1.49101417],
       [ 0.57191043, -0.55341711,  0.03587551,  0.06021671]])

In [79]:
date_df  # does not include the index or column labels in the output

                   A         B         C         D
2019-06-01  0.096359  0.897291 -1.342778 -2.378516
2019-06-02 -1.438505 -0.389565  0.922404  0.078864
2019-06-03  0.630953  0.209136 -0.399125  1.404642
2019-06-04 -1.228804  0.501728 -0.839617  0.870606
2019-06-05  1.977991  0.598679 -0.513562 -1.491014
2019-06-06  0.571910 -0.553417  0.035876  0.060217

In [80]:
# Summary
df.describe()

         A    C    D    H
count  4.0  4.0  4.0  4.0
mean   1.0  1.0  3.0  1.0
std    0.0  0.0  0.0  0.0
min    1.0  1.0  3.0  1.0
25%    1.0  1.0  3.0  1.0
50%    1.0  1.0  3.0  1.0
75%    1.0  1.0  3.0  1.0
max    1.0  1.0  3.0  1.0

In [81]:
# Transpose
df.T

,0,1,2,3
A,1,1,1,1
B,2019-06-01 00:00:00,2019-06-01 00:00:00,2019-06-01 00:00:00,2019-06-01 00:00:00
C,1,1,1,1
D,3,3,3,3
E,test,train,test,train
F,foo,foo,foo,foo
G,2019-06-01 00:00:00,2019-06-02 00:00:00,2019-06-03 00:00:00,2019-06-04 00:00:00
H,1,1,1,1

In [82]:
# Sorting by an axis
df.sort_index(axis=1, ascending=False)

   H          G    F      E  D    C          B  A
0  1 2019-06-01  foo   test  3  1.0 2019-06-01  1
1  1 2019-06-02  foo  train  3  1.0 2019-06-01  1
2  1 2019-06-03  foo   test  3  1.0 2019-06-01  1
3  1 2019-06-04  foo  train  3  1.0 2019-06-01  1

In [83]:
# Sorting by an axis
df.sort_index(axis=0, ascending=False)

   A          B    C  D      E    F          G  H
3  1 2019-06-01  1.0  3  train  foo 2019-06-04  1
2  1 2019-06-01  1.0  3   test  foo 2019-06-03  1
1  1 2019-06-01  1.0  3  train  foo 2019-06-02  1
0  1 2019-06-01  1.0  3   test  foo 2019-06-01  1

In [84]:
# Sorting by values
df.sort_values(by='B')

   A          B    C  D      E    F          G  H
0  1 2019-06-01  1.0  3   test  foo 2019-06-01  1
1  1 2019-06-01  1.0  3  train  foo 2019-06-02  1
2  1 2019-06-01  1.0  3   test  foo 2019-06-03  1
3  1 2019-06-01  1.0  3  train  foo 2019-06-04  1

### Selection

#### Recommend the optimized pandas data access methods, .at, .iat, .loc and .iloc

In [85]:
# Selecting a single column equivalent to df.A
df['A']

0    1
1    1
2    1
3    1
Name: A, dtype: int64

In [86]:
# Selecting via [], which slices the rows
df[0:3]

   A          B    C  D      E    F          G  H
0  1 2019-06-01  1.0  3   test  foo 2019-06-01  1
1  1 2019-06-01  1.0  3  train  foo 2019-06-02  1
2  1 2019-06-01  1.0  3   test  foo 2019-06-03  1

In [91]:
df['G']

0   2019-06-01
1   2019-06-02
2   2019-06-03
3   2019-06-04
Name: G, dtype: datetime64[ns]

#### Selection by label

In [93]:
# Selection by label - cross section using a label
date_df.loc[dates[0]]

A    0.096359
B    0.897291
C   -1.342778
D   -2.378516
Name: 2019-06-01 00:00:00, dtype: float64

In [95]:
# Selecting on a multi-axis by label
df.loc[:2, ['A', 'B']]

   A          B
0  1 2019-06-01
1  1 2019-06-01
2  1 2019-06-01

In [96]:
# Showing label slicing, both endpoints
df.loc['20190601':'20190604', ['A', 'B']]

Empty DataFrame
Columns: [A, B]
Index: []

In [97]:
# Showing label slicing, both endpoints
df.loc['0':'2', ['A', 'B']]

   A          B
0  1 2019-06-01
1  1 2019-06-01
2  1 2019-06-01

In [107]:
# Scalar value
df.loc[3, 'B']

Timestamp('2019-06-01 00:00:00')

#### Selection by Position

In [109]:
# Select via the position of passed integers
df.iloc[3]

A                      1
B    2019-06-01 00:00:00
C                      1
D                      3
E                  train
F                    foo
G    2019-06-04 00:00:00
H                      1
Name: 3, dtype: object

In [110]:
# Integer slices
df.iloc[3:5, 0:2]

   A          B
3  1 2019-06-01

In [111]:
df

   A          B    C  D      E    F          G  H
0  1 2019-06-01  1.0  3   test  foo 2019-06-01  1
1  1 2019-06-01  1.0  3  train  foo 2019-06-02  1
2  1 2019-06-01  1.0  3   test  foo 2019-06-03  1
3  1 2019-06-01  1.0  3  train  foo 2019-06-04  1

In [114]:
# Slice by lists of integer position locations
df.iloc[[1,2,3], [1,4]]

           B      E
1 2019-06-01  train
2 2019-06-01   test
3 2019-06-01  train

In [140]:
# Explicitly slicing rows
df.iloc[1:3,:]

   A          B    C  D      E    F          G  H
1  1 2019-06-01  1.0  3  train  foo 2019-06-02  1
2  1 2019-06-01  1.0  3   test  foo 2019-06-03  1

In [141]:
# Explicitly slicing cols
df.iloc[:, 1:3]

           B    C
0 2019-06-01  1.0
1 2019-06-01  1.0
2 2019-06-01  1.0
3 2019-06-01  1.0

In [126]:
# For getting a value explicitly
df.iloc[1,1]

Timestamp('2019-06-01 00:00:00')

In [127]:
# For getting fast access to a scalar (equivalent to the prior method)
df.iat[1,1]

Timestamp('2019-06-01 00:00:00')

#### Boolean indexing

In [150]:
df[df.A>0]

   A          B    C  D      E    F          G  H
0  1 2019-06-01  1.0  3   test  foo 2019-06-01  1
1  1 2019-06-01  1.0  3  train  foo 2019-06-02  1
2  1 2019-06-01  1.0  3   test  foo 2019-06-03  1
3  1 2019-06-01  1.0  3  train  foo 2019-06-04  1

In [151]:
df[df.G>'20190602']

   A          B    C  D      E    F          G  H
2  1 2019-06-01  1.0  3   test  foo 2019-06-03  1
3  1 2019-06-01  1.0  3  train  foo 2019-06-04  1

In [153]:
# Selecting values from a DataFrame where a boolean condition is met
date_df[date_df>0]

                   A         B         C         D
2019-06-01  0.096359  0.897291       NaN       NaN
2019-06-02       NaN       NaN  0.922404  0.078864
2019-06-03  0.630953  0.209136       NaN  1.404642
2019-06-04       NaN  0.501728       NaN  0.870606
2019-06-05  1.977991  0.598679       NaN       NaN
2019-06-06  0.571910       NaN  0.035876  0.060217

In [154]:
# Copy df
date_df2 = date_df.copy()

In [156]:
# Create a new column E
date_df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [157]:
# Select using .isin() method
date_df2[date_df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2019-06-03  0.630953  0.209136 -0.399125  1.404642   two
2019-06-05  1.977991  0.598679 -0.513562 -1.491014  four

#### Settings

In [158]:
# Setting a new column automatically aligns the data by the indexes
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20190601', periods=6))
s1

2019-06-01    1
2019-06-02    2
2019-06-03    3
2019-06-04    4
2019-06-05    5
2019-06-06    6
Freq: D, dtype: int64

In [160]:
date_df['F'] = s1

In [161]:
date_df

                   A         B         C         D  F
2019-06-01  0.096359  0.897291 -1.342778 -2.378516  1
2019-06-02 -1.438505 -0.389565  0.922404  0.078864  2
2019-06-03  0.630953  0.209136 -0.399125  1.404642  3
2019-06-04 -1.228804  0.501728 -0.839617  0.870606  4
2019-06-05  1.977991  0.598679 -0.513562 -1.491014  5
2019-06-06  0.571910 -0.553417  0.035876  0.060217  6

In [164]:
# Setting values by label
df.at[dates[0], 'A'] = 100

In [165]:
df

                         A          B    C    D      E    F          G    H
0                      1.0 2019-06-01  1.0  3.0   test  foo 2019-06-01  1.0
1                      1.0 2019-06-01  1.0  3.0  train  foo 2019-06-02  1.0
2                      1.0 2019-06-01  1.0  3.0   test  foo 2019-06-03  1.0
3                      1.0 2019-06-01  1.0  3.0  train  foo 2019-06-04  1.0
2019-06-01 00:00:00  100.0        NaT  NaN  NaN    NaN  NaN        NaT  NaN

In [166]:
# Setting values by position
df.iat[0,1]

Timestamp('2019-06-01 00:00:00')

In [167]:
df.iat[0,1] = 0

In [168]:
df

                         A          B    C    D      E    F          G    H
0                      1.0 1970-01-01  1.0  3.0   test  foo 2019-06-01  1.0
1                      1.0 2019-06-01  1.0  3.0  train  foo 2019-06-02  1.0
2                      1.0 2019-06-01  1.0  3.0   test  foo 2019-06-03  1.0
3                      1.0 2019-06-01  1.0  3.0  train  foo 2019-06-04  1.0
2019-06-01 00:00:00  100.0        NaT  NaN  NaN    NaN  NaN        NaT  NaN

In [169]:
# Assigning with a NumPy array
df.loc[:, 'D'] = np.array([5]*len(df))
df

                         A          B    C  D      E    F          G    H
0                      1.0 1970-01-01  1.0  5   test  foo 2019-06-01  1.0
1                      1.0 2019-06-01  1.0  5  train  foo 2019-06-02  1.0
2                      1.0 2019-06-01  1.0  5   test  foo 2019-06-03  1.0
3                      1.0 2019-06-01  1.0  5  train  foo 2019-06-04  1.0
2019-06-01 00:00:00  100.0        NaT  NaN  5    NaN  NaN        NaT  NaN

In [170]:
c6 = np.array([5]*len(df))
df['I'] = c6
df

                         A          B    C  D      E    F          G    H  I
0                      1.0 1970-01-01  1.0  5   test  foo 2019-06-01  1.0  5
1                      1.0 2019-06-01  1.0  5  train  foo 2019-06-02  1.0  5
2                      1.0 2019-06-01  1.0  5   test  foo 2019-06-03  1.0  5
3                      1.0 2019-06-01  1.0  5  train  foo 2019-06-04  1.0  5
2019-06-01 00:00:00  100.0        NaT  NaN  5    NaN  NaN        NaT  NaN  5

#### Missing Data

pandas primarily uses the value np.nan to represent missing data. It is by default not included in computations. See the Missing Data section.

In [173]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['J'])

In [174]:
df1

                A   B   C    D    E    F   G   H    I   J
2019-06-01  100.0 NaT NaN  5.0  NaN  NaN NaT NaN  5.0 NaN
2019-06-02    NaN NaT NaN  NaN  NaN  NaN NaT NaN  NaN NaN
2019-06-03    NaN NaT NaN  NaN  NaN  NaN NaT NaN  NaN NaN
2019-06-04    NaN NaT NaN  NaN  NaN  NaN NaT NaN  NaN NaN

In [175]:
# Drop any rows that have missing data (similar to dropisna)
df1.dropna(how='any')
df1

                A   B   C    D    E    F   G   H    I   J
2019-06-01  100.0 NaT NaN  5.0  NaN  NaN NaT NaN  5.0 NaN
2019-06-02    NaN NaT NaN  NaN  NaN  NaN NaT NaN  NaN NaN
2019-06-03    NaN NaT NaN  NaN  NaN  NaN NaT NaN  NaN NaN
2019-06-04    NaN NaT NaN  NaN  NaN  NaN NaT NaN  NaN NaN

In [192]:
np.array([1,4])

array([1, 4])

In [197]:
np.random.randint(100,200)

183

In [200]:
np.random.randn(10,10)

array([[ 1.07959092, -0.29652303, -1.49237668,  1.03712709, -0.5506878 ,
        -0.21407779, -0.46625793,  0.52077013,  0.34578817, -0.52950715],
       [ 0.8185225 , -1.47673381, -0.47395239, -0.30186764,  0.34007989,
        -0.45565917,  1.39091565, -1.14472569, -0.41558697, -0.31964575],
       [ 0.35629997,  0.28506357,  0.82261683,  0.60173836, -0.88892165,
        -0.25522136, -0.2132128 ,  0.33928377,  0.53728277, -0.60809103],
       [ 0.80717055,  0.93659381,  1.13761699, -0.95377979,  0.4588289 ,
         0.01566109,  0.18616131, -0.85467476,  0.73724512, -0.02538095],
       [ 0.38596597, -0.6287199 ,  0.11529366,  0.41562105,  0.85976702,
        -2.58702031, -0.79740443, -1.28486643,  1.43621586, -0.03360903],
       [ 0.49635434, -1.69095522,  0.05760231,  0.74497886,  1.52081189,
         0.33914033, -1.7185622 , -0.63601744, -0.40223473, -0.08817057],
       [ 0.51611733, -0.45664757, -0.4380805 ,  0.03693265,  0.761344  ,
         0.79251122, -0.99253665, -0.183083  ,  1.08402954,  0.19809434],
       [ 1.33508956,  0.76164959,  0.19306803,  1.96246385, -0.84274658,
        -1.02339105,  0.05674647, -0.88257362,  0.66102815,  0.14316845],
       [ 0.21262365, -0.9462531 ,  1.44455828, -1.08901606, -0.83246189,
        -0.09152276,  2.42647208, -0.28103359,  0.68034711, -0.6556936 ],
       [-0.22312906,  0.51081278,  1.51926668, -1.40080266,  0.40427449,
        -1.00234669,  1.01418392,  0.32142401,  0.51235419, -0.3283764 ]])

In [201]:
# Create a dataframe by passing a numpy random array with 6 columns
newdf = pd.DataFrame(np.random.randn(6,6), index=dates, columns=list('ABCDEF'))
newdf

                   A         B         C         D         E         F
2019-06-01  0.787187  1.472588  0.511230  1.077467 -0.614541  0.592463
2019-06-02  0.469952  0.638397 -0.707667  0.073751 -0.263186 -0.607232
2019-06-03  0.614622 -1.186901  0.122506 -1.460837 -0.087493 -2.055942
2019-06-04 -0.350740 -0.630829 -1.371153  0.241540  1.314750 -0.539195
2019-06-05 -0.114993  1.099502  0.026918 -0.818719 -0.385101  2.899520
2019-06-06  0.306485 -0.213459 -0.804449  0.357432 -0.828348 -1.347632

In [202]:
# Does a rolling sum downward
newdf.apply(np.cumsum)

                   A         B         C         D         E         F
2019-06-01  0.787187  1.472588  0.511230  1.077467 -0.614541  0.592463
2019-06-02  1.257139  2.110986 -0.196437  1.151218 -0.877727 -0.014769
2019-06-03  1.871761  0.924085 -0.073931 -0.309618 -0.965219 -2.070710
2019-06-04  1.521021  0.293256 -1.445085 -0.068078  0.349531 -2.609905
2019-06-05  1.406028  1.392758 -1.418167 -0.886798 -0.035571  0.289614
2019-06-06  1.712513  1.179299 -2.222616 -0.529365 -0.863918 -1.058018

#### Merge

In [203]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -1.054123  0.312490  0.339755 -0.180686
1 -1.206247 -0.335470  2.276049  0.384012
2  0.363583 -0.337642  1.951765  0.951577
3  1.615151  0.144768  0.719944  0.358095
4 -0.368647 -0.547853  0.255252 -1.978730
5  0.888888 -0.118988 -0.324481  0.273810
6 -0.048816  0.192628 -0.950365  1.301057
7 -1.106537  0.031153 -1.191992  0.264235
8  0.460273  1.047072  1.775686  0.603275
9 -1.986342 -0.530929  0.296227 -0.962647

In [204]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0 -1.054123  0.312490  0.339755 -0.180686
 1 -1.206247 -0.335470  2.276049  0.384012
 2  0.363583 -0.337642  1.951765  0.951577,
           0         1         2         3
 3  1.615151  0.144768  0.719944  0.358095
 4 -0.368647 -0.547853  0.255252 -1.978730
 5  0.888888 -0.118988 -0.324481  0.273810
 6 -0.048816  0.192628 -0.950365  1.301057,
           0         1         2         3
 7 -1.106537  0.031153 -1.191992  0.264235
 8  0.460273  1.047072  1.775686  0.603275
 9 -1.986342 -0.530929  0.296227 -0.962647]

In [205]:
# Concat pieces together
pd.concat(pieces)

          0         1         2         3
0 -1.054123  0.312490  0.339755 -0.180686
1 -1.206247 -0.335470  2.276049  0.384012
2  0.363583 -0.337642  1.951765  0.951577
3  1.615151  0.144768  0.719944  0.358095
4 -0.368647 -0.547853  0.255252 -1.978730
5  0.888888 -0.118988 -0.324481  0.273810
6 -0.048816  0.192628 -0.950365  1.301057
7 -1.106537  0.031153 -1.191992  0.264235
8  0.460273  1.047072  1.775686  0.603275
9 -1.986342 -0.530929  0.296227 -0.962647

#### Join

In [206]:
# Create two dataframe by passing a dictionary
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [207]:
left

   key  lval
0  foo     1
1  foo     2

In [208]:
right

   key  rval
0  foo     4
1  foo     5

In [209]:
# Merge method
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [211]:
# Another example
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})
print(left)
print(right)

# Join
pd.merge(left, right, on='key')

   key  lval
0  foo     1
1  bar     2
   key  rval
0  foo     4
1  bar     5

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [213]:
df = pd.DataFrame(np.random.randn(5,5), columns=['a','b','c','d','e'])
df

          a         b         c         d         e
0  0.730176 -2.398974 -0.374691  0.203399  1.342126
1 -1.457348  0.130756 -1.410698  0.014905  1.158510
2  0.543468  0.000076 -1.384604 -1.148224  0.981357
3  1.792541 -0.621996 -0.630208  1.705276 -0.211796
4 -0.290917  1.537115  1.075066  1.408900 -0.027128

In [216]:
# Extract row 3
s = df.iloc[3]
s

a    1.792541
b   -0.621996
c   -0.630208
d    1.705276
e   -0.211796
Name: 3, dtype: float64

In [219]:
# Append s to df
df.append(s, ignore_index=True)
df

          a         b         c         d         e
0  0.730176 -2.398974 -0.374691  0.203399  1.342126
1 -1.457348  0.130756 -1.410698  0.014905  1.158510
2  0.543468  0.000076 -1.384604 -1.148224  0.981357
3  1.792541 -0.621996 -0.630208  1.705276 -0.211796
4 -0.290917  1.537115  1.075066  1.408900 -0.027128

In [220]:
df.append(df, ignore_index=True)
df

          a         b         c         d         e
0  0.730176 -2.398974 -0.374691  0.203399  1.342126
1 -1.457348  0.130756 -1.410698  0.014905  1.158510
2  0.543468  0.000076 -1.384604 -1.148224  0.981357
3  1.792541 -0.621996 -0.630208  1.705276 -0.211796
4 -0.290917  1.537115  1.075066  1.408900 -0.027128

#### Grouping

In [271]:
dd = pd.date_range('20190601', periods=5)
five_array = np.array([10,20,30,40,50])
df = pd.DataFrame({                                                        
    'a': ['hello','my','name','is','jacc'],                          # a            object
    'b': ['hello','my','name','is','ccaj'],                          # b            object
    'c': np.random.randint(10),                                      # c             int64
    'd': np.random.randint(50, size=5),                              # d             int32
    'e': dd,                                                         # e    datetime64[ns]
    'f': pd.Timestamp('20190601'),                                   # f    datetime64[ns]
    'g': pd.Series(10, index=list(range(5)), dtype='float32'),       # g           float32
    'h': np.random.randn(5),                                         # h           float64
    'i': ['a','b','c','d','e'],                                      # i            object
    'j': five_array                                                  # j             int32
                  })
df

       a      b  c   d          e          f     g         h  i   j
0  hello  hello  4  47 2019-06-01 2019-06-01  10.0  0.877144  a  10
1     my     my  4   5 2019-06-02 2019-06-01  10.0 -0.492208  b  20
2   name   name  4  12 2019-06-03 2019-06-01  10.0 -1.348618  c  30
3     is     is  4  18 2019-06-04 2019-06-01  10.0  0.297059  d  40
4   jacc   ccaj  4  24 2019-06-05 2019-06-01  10.0  1.357478  e  50

In [272]:
np.random.randint(10, size = 5)

array([0, 8, 9, 9, 5])

In [273]:
np.random.randn(1,10)

array([[ 1.98927502e+00, -7.59916313e-02, -7.91158889e-01,
        -2.50709758e-01, -1.42375167e-01,  8.57176141e-01,
        -1.31682197e-01, -1.85170259e+00,  5.42387709e-01,
         1.90423370e-03]])

In [274]:
np.random.randn(1,5)

array([[ 0.48949704,  0.5661327 , -0.49451914, -1.58072955,  1.37432581]])

In [275]:
five_array = np.array([10,20,30,40,50])
five_array

array([10, 20, 30, 40, 50])

In [276]:
df.dtypes

a            object
b            object
c             int64
d             int32
e    datetime64[ns]
f    datetime64[ns]
g           float32
h           float64
i            object
j             int32
dtype: object

By “group by” we are referring to a process involving one or more of the following steps:

- Splitting the data into groups based on some criteria
- Applying a function to each group independently
- Combining the results into a data structure

In [277]:
df

       a      b  c   d          e          f     g         h  i   j
0  hello  hello  4  47 2019-06-01 2019-06-01  10.0  0.877144  a  10
1     my     my  4   5 2019-06-02 2019-06-01  10.0 -0.492208  b  20
2   name   name  4  12 2019-06-03 2019-06-01  10.0 -1.348618  c  30
3     is     is  4  18 2019-06-04 2019-06-01  10.0  0.297059  d  40
4   jacc   ccaj  4  24 2019-06-05 2019-06-01  10.0  1.357478  e  50

In [278]:
# Grouping and then applying the sum() function to the resulting groups.
df.groupby('e')

In [279]:
df.groupby('e').sum()

            c   d     g         h   j
e
2019-06-01  4  47  10.0  0.877144  10
2019-06-02  4   5  10.0 -0.492208  20
2019-06-03  4  12  10.0 -1.348618  30
2019-06-04  4  18  10.0  0.297059  40
2019-06-05  4  24  10.0  1.357478  50

In [280]:
df.groupby(['a', 'b']).sum()

             c   d     g         h   j
a     b
hello hello  4  47  10.0  0.877144  10
is    is     4  18  10.0  0.297059  40
jacc  ccaj   4  24  10.0  1.357478  50
my    my     4   5  10.0 -0.492208  20
name  name   4  12  10.0 -1.348618  30

#### Time Series

pandas has simple, powerful, and efficient functionality for performing resampling operations during frequency conversion (e.g., converting secondly data into 5-minutely data). This is extremely common in, but not limited to, financial applications.

http://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#timeseries

In [282]:
rng = pd.date_range('1/1/2019', periods=10, freq='S')
rng

DatetimeIndex(['2019-01-01 00:00:00', '2019-01-01 00:00:01',
               '2019-01-01 00:00:02', '2019-01-01 00:00:03',
               '2019-01-01 00:00:04', '2019-01-01 00:00:05',
               '2019-01-01 00:00:06', '2019-01-01 00:00:07',
               '2019-01-01 00:00:08', '2019-01-01 00:00:09'],
              dtype='datetime64[ns]', freq='S')

In [288]:
# Create a series of dates with periods and set the frequency parameter to days
rng = pd.date_range('1/1/2019', periods=10, freq='D')
rng

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10'],
              dtype='datetime64[ns]', freq='D')

In [289]:
# Create a series with index date_range
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
ts

2019-01-01     66
2019-01-02    476
2019-01-03    305
2019-01-04    496
2019-01-05    363
2019-01-06    208
2019-01-07    487
2019-01-08    408
2019-01-09    367
2019-01-10    458
Freq: D, dtype: int32

In [290]:
np.random.randint(0, 500)

120

In [291]:
ts.resample('5Min').sum()

2019-01-01 00:00:00     66
2019-01-01 00:05:00      0
2019-01-01 00:10:00      0
2019-01-01 00:15:00      0
2019-01-01 00:20:00      0
2019-01-01 00:25:00      0
2019-01-01 00:30:00      0
2019-01-01 00:35:00      0
2019-01-01 00:40:00      0
2019-01-01 00:45:00      0
2019-01-01 00:50:00      0
2019-01-01 00:55:00      0
2019-01-01 01:00:00      0
2019-01-01 01:05:00      0
2019-01-01 01:10:00      0
2019-01-01 01:15:00      0
2019-01-01 01:20:00      0
2019-01-01 01:25:00      0
2019-01-01 01:30:00      0
2019-01-01 01:35:00      0
2019-01-01 01:40:00      0
2019-01-01 01:45:00      0
2019-01-01 01:50:00      0
2019-01-01 01:55:00      0
2019-01-01 02:00:00      0
2019-01-01 02:05:00      0
2019-01-01 02:10:00      0
2019-01-01 02:15:00      0
2019-01-01 02:20:00      0
2019-01-01 02:25:00      0
                      ...
2019-01-09 21:35:00      0
2019-01-09 21:40:00      0
2019-01-09 21:45:00      0
2019-01-09 21:50:00      0
2019-01-09 21:55:00      0
2019-01-09 22:00:00      0
2019-01-09 22:05:00      0
2019-01-09 22:10:00      0
2019-01-09 22:15:00      0
2019-01-09 22:20:00      0
2019-01-09 22:25:00      0
2019-01-09 22:30:00      0
2019-01-09 22:35:00      0
2019-01-09 22:40:00      0
2019-01-09 22:45:00      0
2019-01-09 22:50:00      0
2019-01-09 22:55:00      0
2019-01-09 23:00:00      0
2019-01-09 23:05:00      0
2019-01-09 23:10:00      0
2019-01-09 23:15:00      0
2019-01-09 23:20:00      0
2019-01-09 23:25:00      0
2019-01-09 23:30:00      0
2019-01-09 23:35:00      0
2019-01-09 23:40:00      0
2019-01-09 23:45:00      0
2019-01-09 23:50:00      0
2019-01-09 23:55:00      0
2019-01-10 00:00:00    458
Freq: 5T, Length: 2593, dtype: int32

In [292]:
# Time zone representation
rng = pd.date_range('3/6/2019 00:00', periods=5, freq='D')
ts = pd.Series(np.random.randn(len(rng)), rng)

In [293]:
ts

2019-03-06    2.497627
2019-03-07   -0.954481
2019-03-08   -0.366667
2019-03-09   -0.811544
2019-03-10   -1.594390
Freq: D, dtype: float64

In [295]:
print(np.random.randint(10)) # randint samples a random number
np.random.randn(10)          # randn samples an array of numbers

0

array([-1.01992122,  0.27526747,  0.72455098, -2.8351653 ,  0.35846299,
        0.829252  ,  0.86389466, -1.57732176,  0.13026758, -0.15848492])

In [296]:
# Time zone rep
ts_utc = ts.tz_localize('UTC')
ts_utc

2019-03-06 00:00:00+00:00    2.497627
2019-03-07 00:00:00+00:00   -0.954481
2019-03-08 00:00:00+00:00   -0.366667
2019-03-09 00:00:00+00:00   -0.811544
2019-03-10 00:00:00+00:00   -1.594390
Freq: D, dtype: float64

In [297]:
# Converting to another time zone
ts_utc.tz_convert('US/Eastern')

2019-03-05 19:00:00-05:00    2.497627
2019-03-06 19:00:00-05:00   -0.954481
2019-03-07 19:00:00-05:00   -0.366667
2019-03-08 19:00:00-05:00   -0.811544
2019-03-09 19:00:00-05:00   -1.594390
Freq: D, dtype: float64

Converting between period and timestamp enables some convenient arithmetic functions to be used. In the following example, we convert a quarterly frequency with year ending in November to 9am of the end of the month following the quarter end:

In [300]:
prng = pd.period_range('1997Q1', '2000Q4', freq='Q-NOV')
prng

PeriodIndex(['1997Q1', '1997Q2', '1997Q3', '1997Q4', '1998Q1', '1998Q2',
             '1998Q3', '1998Q4', '1999Q1', '1999Q2', '1999Q3', '1999Q4',
             '2000Q1', '2000Q2', '2000Q3', '2000Q4'],
            dtype='period[Q-NOV]', freq='Q-NOV')

In [301]:
ts = pd.Series(np.random.randn(len(prng)), prng)
ts

1997Q1    1.363722
1997Q2   -0.081128
1997Q3   -1.618411
1997Q4    1.103649
1998Q1    1.011439
1998Q2    0.455288
1998Q3   -0.130506
1998Q4   -0.649820
1999Q1    0.534027
1999Q2   -1.775283
1999Q3   -0.865637
1999Q4   -1.767993
2000Q1    1.693358
2000Q2   -0.404669
2000Q3   -1.246575
2000Q4    0.473171
Freq: Q-NOV, dtype: float64

In [302]:
ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9

In [303]:
ts

1997-03-01 09:00    1.363722
1997-06-01 09:00   -0.081128
1997-09-01 09:00   -1.618411
1997-12-01 09:00    1.103649
1998-03-01 09:00    1.011439
1998-06-01 09:00    0.455288
1998-09-01 09:00   -0.130506
1998-12-01 09:00   -0.649820
1999-03-01 09:00    0.534027
1999-06-01 09:00   -1.775283
1999-09-01 09:00   -0.865637
1999-12-01 09:00   -1.767993
2000-03-01 09:00    1.693358
2000-06-01 09:00   -0.404669
2000-09-01 09:00   -1.246575
2000-12-01 09:00    0.473171
Freq: H, dtype: float64

### Categorical

In [309]:
df = pd.DataFrame({"id": [1, 2, 3, 4, 5, 6],
                   "raw_grade": ['a', 'b', 'b', 'a', 'a', 'e']})
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [310]:
df["grade"] = df["raw_grade"].astype("category")

In [311]:
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [312]:
df

   id raw_grade grade
0   1         a     a
1   2         b     b
2   3         b     b
3   4         a     a
4   5         a     a
5   6         e     e

In [313]:
# Rename the categories
df["grade"].cat.categories = ["very good", "good", "very bad"]
df

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [314]:
# Reorder the categories and simultaneously add the missing categories 
# (methods under Series .cat return a new Series by default).
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])
df

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [315]:
# Sorting is per order in the categories, not lexical order.
df.sort_values(by="grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

In [316]:
df.groupby("grade").size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64

In [318]:
df.size

18